app/controllers/game_words_controller.rb

  def result
    @text_game = @@text_globe
    input_text = params[:n_s]
    @k = 0
    @wpm = 0
    @res = ''
    if @@game_mode == 1 then
      if input_text != nil then
        @@flag = 1
        @time_end = Time.now
        @del_time = @time_end - @@time_start
        @inp_l = input_text.length
        length_origin = @text_game.length
        length_input = input_text.length
        if length_input == length_origin then
          (0..length_input).each { |i|
            if @text_game[i] == input_text[i] then
              @k += 1
            end
          }
          @wpm = (@k/@del_time * 60).round
          @res = 'Complete'
          ActionTime.create(gen_time: @del_time.round(2), user_id: current_user.id) if @wpm != 0
          @user = User.find(current_user.id)
          if @user.time_best == 0.0 then
            @user.time_best = @del_time.round(2)
            @user.save
---
INSERT INTO "actions" ("gen_results", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["gen_results", 101], ["user_id", 1], ["created_at", "2023-01-22 16:49:58.583301"], ["updated_at", "2023-01-22 16:49:58.583301"]]
INSERT INTO "action_times" ("gen_time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["gen_time", 108.81], ["user_id", 1], ["created_at", "2023-01-22 17:43:37.018674"], ["updated_at", "2023-01-22 17:43:37.018674"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "time_best" = ? WHERE "users"."id" = ?  [["updated_at", "2023-01-22 18:25:17.006586"], ["time_best", 47.24], ["id", 3]]

          }
          @wpm = (@k/@del_time * 60).round
          @res = 'Complete'
          Action.create(gen_results: @wpm, user_id: current_user.id) if @wpm != 0
          @user = User.find(current_user.id)
---
INSERT INTO "actions" ("gen_results", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["gen_results", 149], ["user_id", 1], ["created_at", "2023-01-23 02:07:17.651909"], ["updated_at", "2023-01-23 02:07:17.651909"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

          }
          @wpm = (@k/@del_time * 60).round
          @res = 'Complete'
          Action.create(gen_results: @wpm, user_id: current_user.id) if @wpm != 0
          @user = User.find(current_user.id)
          if @user.statistics < @wpm  then
            @user.statistics = @wpm
            @user.save
---
INSERT INTO "actions" ("gen_results", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["gen_results", 69], ["user_id", 4], ["created_at", "2023-01-24 00:13:44.084071"], ["updated_at", "2023-01-24 00:13:44.084071"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "statistics" = ? WHERE "users"."id" = ?  [["updated_at", "2023-01-24 00:13:44.097545"], ["statistics", 69], ["id", 4]]

  def progress
    @progress = []
    actions = Action.all
    actions.each do |action|
---
SELECT "actions".* FROM "actions"