app/controllers/game_words_controller.rb

  def progress
    @progress = []
    actions = Action.all
    actions.each do |action|
---
SELECT "actions".* FROM "actions"