app/views/game_words/progress.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    <br/>
    <% prog_prov = User.find(current_user.id) %>

SELECT "actions".* FROM "actions"
---
              </tr>
              <% list_users = Action.all %>

SELECT "action_times".* FROM "action_times"
---
              </tr>
              <% list_users = ActionTime.all %>