app/views/game_words/progress.html.erb

            </tr>
            <% list_users = Action.all %>
---
SELECT "actions".* FROM "actions"

            </tr>
            <% list_users = ActionTime.all %>
---
SELECT "action_times".* FROM "action_times"