app/views/game_words/table_res.html.erb

            </tr>
            <% list_users = User.all %>
---
SELECT "users".* FROM "users"